{
  "algorithms": [
    {
      "algorithmName": "bikel1",
      "description": "BIKE Level 1: A post-quantum key encapsulation mechanism (KEM) based on quasi-cyclic moderate-density parity-check (QC-MDPC) codes. Designed for lightweight and efficient key exchange.",
      "keySize": 256,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "p256_bikel1",
      "description": "BIKE Level 1 with P-256 hybrid: Combines BIKE Level 1 with elliptic curve P-256 for hybrid key exchange, providing both post-quantum and classical security.",
      "keySize": 256,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "x25519_bikel1",
      "description": "BIKE Level 1 with X25519 hybrid: Combines BIKE Level 1 with X25519 for hybrid key exchange, offering post-quantum security alongside classical elliptic curve cryptography.",
      "keySize": 256,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "bikel3",
      "description": "BIKE Level 3: A higher-security variant of BIKE KEM, designed for applications requiring stronger security guarantees.",
      "keySize": 384,
      "securityLevel": "Level 3"
    },
    {
      "algorithmName": "p384_bikel3",
      "description": "BIKE Level 3 with P-384 hybrid: Combines BIKE Level 3 with elliptic curve P-384 for hybrid key exchange, providing enhanced security for critical applications.",
      "keySize": 384,
      "securityLevel": "Level 3"
    },
    {
      "algorithmName": "x448_bikel3",
      "description": "BIKE Level 3 with X448 hybrid: Combines BIKE Level 3 with X448 for hybrid key exchange, offering post-quantum and classical security in a single protocol.",
      "keySize": 448,
      "securityLevel": "Level 3"
    },
    {
      "algorithmName": "bikel5",
      "description": "BIKE Level 5: The highest-security variant of BIKE KEM, designed for applications requiring the strongest security guarantees.",
      "keySize": 521,
      "securityLevel": "Level 5"
    },
    {
      "algorithmName": "p521_bikel5",
      "description": "BIKE Level 5 with P-521 hybrid: Combines BIKE Level 5 with elliptic curve P-521 for hybrid key exchange, providing the highest level of security for critical systems.",
      "keySize": 521,
      "securityLevel": "Level 5"
    },
    {
      "algorithmName": "frodo640aes",
      "description": "FrodoKEM-640-AES: A post-quantum KEM based on the Learning With Errors (LWE) problem, using AES for symmetric operations. Designed for practical and efficient key exchange.",
      "keySize": 640,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "p256_frodo640aes",
      "description": "FrodoKEM-640-AES with P-256 hybrid: Combines FrodoKEM-640-AES with elliptic curve P-256 for hybrid key exchange, offering both post-quantum and classical security.",
      "keySize": 640,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "x25519_frodo640aes",
      "description": "FrodoKEM-640-AES with X25519 hybrid: Combines FrodoKEM-640-AES with X25519 for hybrid key exchange, providing a balance of post-quantum and classical security.",
      "keySize": 640,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "frodo640shake",
      "description": "FrodoKEM-640-SHAKE: A post-quantum KEM based on the Learning With Errors (LWE) problem, using SHAKE for symmetric operations. Offers a lightweight alternative to AES-based variants.",
      "keySize": 640,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "p256_frodo640shake",
      "description": "FrodoKEM-640-SHAKE with P-256 hybrid: Combines FrodoKEM-640-SHAKE with elliptic curve P-256 for hybrid key exchange, providing post-quantum and classical security.",
      "keySize": 640,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "x25519_frodo640shake",
      "description": "FrodoKEM-640-SHAKE with X25519 hybrid: Combines FrodoKEM-640-SHAKE with X25519 for hybrid key exchange, offering a lightweight and secure key exchange protocol.",
      "keySize": 640,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "frodo976aes",
      "description": "FrodoKEM-976-AES: A higher-security variant of FrodoKEM using AES for symmetric operations. Designed for applications requiring stronger security guarantees.",
      "keySize": 976,
      "securityLevel": "Level 3"
    },
    {
      "algorithmName": "p384_frodo976aes",
      "description": "FrodoKEM-976-AES with P-384 hybrid: Combines FrodoKEM-976-AES with elliptic curve P-384 for hybrid key exchange, providing enhanced security for critical applications.",
      "keySize": 976,
      "securityLevel": "Level 3"
    },
    {
      "algorithmName": "x448_frodo976aes",
      "description": "FrodoKEM-976-AES with X448 hybrid: Combines FrodoKEM-976-AES with X448 for hybrid key exchange, offering post-quantum and classical security in a single protocol.",
      "keySize": 976,
      "securityLevel": "Level 3"
    },
    {
      "algorithmName": "frodo976shake",
      "description": "FrodoKEM-976-SHAKE: A higher-security variant of FrodoKEM using SHAKE for symmetric operations. Offers a lightweight alternative to AES-based variants.",
      "keySize": 976,
      "securityLevel": "Level 3"
    },
    {
      "algorithmName": "p384_frodo976shake",
      "description": "FrodoKEM-976-SHAKE with P-384 hybrid: Combines FrodoKEM-976-SHAKE with elliptic curve P-384 for hybrid key exchange, providing enhanced security for critical applications.",
      "keySize": 976,
      "securityLevel": "Level 3"
    },
    {
      "algorithmName": "x448_frodo976shake",
      "description": "FrodoKEM-976-SHAKE with X448 hybrid: Combines FrodoKEM-976-SHAKE with X448 for hybrid key exchange, offering post-quantum and classical security in a single protocol.",
      "keySize": 976,
      "securityLevel": "Level 3"
    },
    {
      "algorithmName": "frodo1344aes",
      "description": "FrodoKEM-1344-AES: The highest-security variant of FrodoKEM using AES for symmetric operations. Designed for applications requiring the strongest security guarantees.",
      "keySize": 1344,
      "securityLevel": "Level 5"
    },
    {
      "algorithmName": "p521_frodo1344aes",
      "description": "FrodoKEM-1344-AES with P-521 hybrid: Combines FrodoKEM-1344-AES with elliptic curve P-521 for hybrid key exchange, providing the highest level of security for critical systems.",
      "keySize": 1344,
      "securityLevel": "Level 5"
    },
    {
      "algorithmName": "frodo1344shake",
      "description": "FrodoKEM-1344-SHAKE: The highest-security variant of FrodoKEM using SHAKE for symmetric operations. Offers a lightweight alternative to AES-based variants.",
      "keySize": 1344,
      "securityLevel": "Level 5"
    },
    {
      "algorithmName": "p521_frodo1344shake",
      "description": "FrodoKEM-1344-SHAKE with P-521 hybrid: Combines FrodoKEM-1344-SHAKE with elliptic curve P-521 for hybrid key exchange, providing the highest level of security for critical systems.",
      "keySize": 1344,
      "securityLevel": "Level 5"
    },
    {
      "algorithmName": "hqc128",
      "description": "HQC-128: A post-quantum KEM based on rank metric codes. Designed for lightweight and efficient key exchange.",
      "keySize": 128,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "p256_hqc128",
      "description": "HQC-128 with P-256 hybrid: Combines HQC-128 with elliptic curve P-256 for hybrid key exchange, providing both post-quantum and classical security.",
      "keySize": 128,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "x25519_hqc128",
      "description": "HQC-128 with X25519 hybrid: Combines HQC-128 with X25519 for hybrid key exchange, offering post-quantum security alongside classical elliptic curve cryptography.",
      "keySize": 128,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "hqc192",
      "description": "HQC-192: A higher-security variant of HQC KEM, designed for applications requiring stronger security guarantees.",
      "keySize": 192,
      "securityLevel": "Level 3"
    },
    {
      "algorithmName": "p384_hqc192",
      "description": "HQC-192 with P-384 hybrid: Combines HQC-192 with elliptic curve P-384 for hybrid key exchange, providing enhanced security for critical applications.",
      "keySize": 192,
      "securityLevel": "Level 3"
    },
    {
      "algorithmName": "x448_hqc192",
      "description": "HQC-192 with X448 hybrid: Combines HQC-192 with X448 for hybrid key exchange, offering post-quantum and classical security in a single protocol.",
      "keySize": 192,
      "securityLevel": "Level 3"
    },
    {
      "algorithmName": "hqc256",
      "description": "HQC-256: The highest-security variant of HQC KEM, designed for applications requiring the strongest security guarantees.",
      "keySize": 256,
      "securityLevel": "Level 5"
    },
    {
      "algorithmName": "p521_hqc256",
      "description": "HQC-256 with P-521 hybrid: Combines HQC-256 with elliptic curve P-521 for hybrid key exchange, providing the highest level of security for critical systems.",
      "keySize": 256,
      "securityLevel": "Level 5"
    },
    {
      "algorithmName": "mlkem512",
      "description": "ML-KEM-512: A post-quantum KEM based on module lattices. Designed for practical and efficient key exchange.",
      "keySize": 512,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "p256_mlkem512",
      "description": "ML-KEM-512 with P-256 hybrid: Combines ML-KEM-512 with elliptic curve P-256 for hybrid key exchange, offering both post-quantum and classical security.",
      "keySize": 512,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "x25519_mlkem512",
      "description": "ML-KEM-512 with X25519 hybrid: Combines ML-KEM-512 with X25519 for hybrid key exchange, providing a balance of post-quantum and classical security.",
      "keySize": 512,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "mlkem768",
      "description": "ML-KEM-768: A higher-security variant of ML-KEM, designed for applications requiring stronger security guarantees.",
      "keySize": 768,
      "securityLevel": "Level 3"
    },
    {
      "algorithmName": "p384_mlkem768",
      "description": "ML-KEM-768 with P-384 hybrid: Combines ML-KEM-768 with elliptic curve P-384 for hybrid key exchange, providing enhanced security for critical applications.",
      "keySize": 768,
      "securityLevel": "Level 3"
    },
    {
      "algorithmName": "x448_mlkem768",
      "description": "ML-KEM-768 with X448 hybrid: Combines ML-KEM-768 with X448 for hybrid key exchange, offering post-quantum and classical security in a single protocol.",
      "keySize": 768,
      "securityLevel": "Level 3"
    },
    {
      "algorithmName": "mlkem1024",
      "description": "ML-KEM-1024: The highest-security variant of ML-KEM, designed for applications requiring the strongest security guarantees.",
      "keySize": 1024,
      "securityLevel": "Level 5"
    },
    {
      "algorithmName": "p521_mlkem1024",
      "description": "ML-KEM-1024 with P-521 hybrid: Combines ML-KEM-1024 with elliptic curve P-521 for hybrid key exchange, providing the highest level of security for critical systems.",
      "keySize": 1024,
      "securityLevel": "Level 5"
    },
    {
      "algorithmName": "mldsa44",
      "description": "ML-DSA-44: A post-quantum digital signature algorithm based on module lattices. Designed for lightweight and efficient signing.",
      "keySize": 44,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "p256_mldsa44",
      "description": "ML-DSA-44 with P-256 hybrid: Combines ML-DSA-44 with elliptic curve P-256 for hybrid signatures, providing both post-quantum and classical security.",
      "keySize": 44,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "rsa3072_mldsa44",
      "description": "ML-DSA-44 with RSA-3072 hybrid: Combines ML-DSA-44 with RSA-3072 for hybrid signatures, offering post-quantum and classical security.",
      "keySize": 44,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "mldsa44_pss2048",
      "description": "ML-DSA-44 with PSS-2048 hybrid: Combines ML-DSA-44 with RSA-PSS-2048 for hybrid signatures, providing enhanced security.",
      "keySize": 44,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "mldsa44_rsa2048",
      "description": "ML-DSA-44 with RSA-2048 hybrid: Combines ML-DSA-44 with RSA-2048 for hybrid signatures, offering post-quantum and classical security.",
      "keySize": 44,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "mldsa44_ed25519",
      "description": "ML-DSA-44 with Ed25519 hybrid: Combines ML-DSA-44 with Ed25519 for hybrid signatures, providing a balance of post-quantum and classical security.",
      "keySize": 44,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "mldsa44_p256",
      "description": "ML-DSA-44 with P-256 hybrid: Combines ML-DSA-44 with elliptic curve P-256 for hybrid signatures, offering post-quantum and classical security.",
      "keySize": 44,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "mldsa44_bp256",
      "description": "ML-DSA-44 with BP-256 hybrid: Combines ML-DSA-44 with Brainpool P-256 for hybrid signatures, providing enhanced security.",
      "keySize": 44,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "mldsa65",
      "description": "ML-DSA-65: A higher-security variant of ML-DSA, designed for applications requiring stronger security guarantees.",
      "keySize": 65,
      "securityLevel": "Level 3"
    },
    {
      "algorithmName": "p384_mldsa65",
      "description": "ML-DSA-65 with P-384 hybrid: Combines ML-DSA-65 with elliptic curve P-384 for hybrid signatures, providing enhanced security for critical applications.",
      "keySize": 65,
      "securityLevel": "Level 3"
    },
    {
      "algorithmName": "mldsa65_pss3072",
      "description": "ML-DSA-65 with PSS-3072 hybrid: Combines ML-DSA-65 with RSA-PSS-3072 for hybrid signatures, offering post-quantum and classical security.",
      "keySize": 65,
      "securityLevel": "Level 3"
    },
    {
      "algorithmName": "mldsa65_rsa3072",
      "description": "ML-DSA-65 with RSA-3072 hybrid: Combines ML-DSA-65 with RSA-3072 for hybrid signatures, providing enhanced security.",
      "keySize": 65,
      "securityLevel": "Level 3"
    },
    {
      "algorithmName": "mldsa65_p256",
      "description": "ML-DSA-65 with P-256 hybrid: Combines ML-DSA-65 with elliptic curve P-256 for hybrid signatures, offering post-quantum and classical security.",
      "keySize": 65,
      "securityLevel": "Level 3"
    },
    {
      "algorithmName": "mldsa65_bp256",
      "description": "ML-DSA-65 with BP-256 hybrid: Combines ML-DSA-65 with Brainpool P-256 for hybrid signatures, providing enhanced security.",
      "keySize": 65,
      "securityLevel": "Level 3"
    },
    {
      "algorithmName": "mldsa65_ed25519",
      "description": "ML-DSA-65 with Ed25519 hybrid: Combines ML-DSA-65 with Ed25519 for hybrid signatures, offering a balance of post-quantum and classical security.",
      "keySize": 65,
      "securityLevel": "Level 3"
    },
    {
      "algorithmName": "mldsa87",
      "description": "ML-DSA-87: The highest-security variant of ML-DSA, designed for applications requiring the strongest security guarantees.",
      "keySize": 87,
      "securityLevel": "Level 5"
    },
    {
      "algorithmName": "p521_mldsa87",
      "description": "ML-DSA-87 with P-521 hybrid: Combines ML-DSA-87 with elliptic curve P-521 for hybrid signatures, providing the highest level of security for critical systems.",
      "keySize": 87,
      "securityLevel": "Level 5"
    },
    {
      "algorithmName": "mldsa87_p384",
      "description": "ML-DSA-87 with P-384 hybrid: Combines ML-DSA-87 with elliptic curve P-384 for hybrid signatures, offering enhanced security for critical applications.",
      "keySize": 87,
      "securityLevel": "Level 5"
    },
    {
      "algorithmName": "mldsa87_bp384",
      "description": "ML-DSA-87 with BP-384 hybrid: Combines ML-DSA-87 with Brainpool P-384 for hybrid signatures, providing enhanced security.",
      "keySize": 87,
      "securityLevel": "Level 5"
    },
    {
      "algorithmName": "mldsa87_ed448",
      "description": "ML-DSA-87 with Ed448 hybrid: Combines ML-DSA-87 with Ed448 for hybrid signatures, offering a balance of post-quantum and classical security.",
      "keySize": 87,
      "securityLevel": "Level 5"
    },
    {
      "algorithmName": "falcon512",
      "description": "Falcon-512: A post-quantum digital signature algorithm based on lattice cryptography. Designed for lightweight and efficient signing.",
      "keySize": 512,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "p256_falcon512",
      "description": "Falcon-512 with P-256 hybrid: Combines Falcon-512 with elliptic curve P-256 for hybrid signatures, providing both post-quantum and classical security.",
      "keySize": 512,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "rsa3072_falcon512",
      "description": "Falcon-512 with RSA-3072 hybrid: Combines Falcon-512 with RSA-3072 for hybrid signatures, offering post-quantum and classical security.",
      "keySize": 512,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "falconpadded512",
      "description": "Falcon-Padded-512: A variant of Falcon-512 with padding for enhanced security and compatibility.",
      "keySize": 512,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "p256_falconpadded512",
      "description": "Falcon-Padded-512 with P-256 hybrid: Combines Falcon-Padded-512 with elliptic curve P-256 for hybrid signatures, providing enhanced security.",
      "keySize": 512,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "rsa3072_falconpadded512",
      "description": "Falcon-Padded-512 with RSA-3072 hybrid: Combines Falcon-Padded-512 with RSA-3072 for hybrid signatures, offering post-quantum and classical security.",
      "keySize": 512,
      "securityLevel": "Level 1"
    },
    {
      "algorithmName": "falcon1024",
      "description": "Falcon-1024: A higher-security variant of Falcon, designed for applications requiring stronger security guarantees.",
      "keySize": 1024,
      "securityLevel": "Level 3"
    },
    {
      "algorithmName": "p521_falcon1024",
      "description": "Falcon-1024 with P-521 hybrid: Combines Falcon-1024 with elliptic curve P-521 for hybrid signatures, providing the highest level of security for critical systems.",
      "keySize": 1024,
      "securityLevel": "Level 3"
    },
    {
      "algorithmName": "falconpadded1024",
      "description": "Falcon-Padded-1024: A variant of Falcon-1024 with padding for enhanced security and compatibility.",
      "keySize": 1024,
      "securityLevel": "Level 3"
    },
    {
      "algorithmName": "p521_falconpadded1024",
      "description": "Falcon-Padded-1024 with P-521 hybrid: Combines Falcon-Padded-1024 with elliptic curve P-521 for hybrid signatures, offering enhanced security.",
      "keySize": 1024,
      "securityLevel": "Level 3"
    }
  ]
}
